#include <REGX52.H>

//注：看手册AT89C52

/**
  * @brief 定时器0初始化，1ms进一次
  * @param 无
  * @retval 无
  */
void Timer0_Init()		//11.0592MHZ
{
	//配置定时器0寄存器(不可位寻址)
	//配置定时器模式0000 0001
	TMOD&=0xF0; //1.把TMOD的低四位清零，高四位保持不变
	TMOD|=0x01; //2.把TMOD的最低位置1，高四位保持不变
	
	TF0 = 0;		//溢出标志位默认给0
	TR0 = 1;		//运行控制位给1运行
	TH0 = 64535 / 256;  //取高八位
	TL0 = 64535 % 256;  //取低八位
	
//	TL0 = 0x66;		//低八位
//	TH0 = 0xFC;		//高八位  总64535，即1000us进一次中断
	/*
	总时：65535，64535us离计数器溢出差值1000，计时为1ms
	*/
		
	//配置中断寄存器
	ET0 = 1;		//定时器0允许中断
	EA = 1;		    //总中断允许
	PT0 = 0;		//中断优先级配置
}

//stc定时器生成
void Timer0Init(void)		//1毫秒@12.000MHz
{
	TMOD &= 0xF0;		//设置定时器模式
	TH0 = 0xFC;		//设置定时初值
	TL0 = 0x18;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
}

//中断服务函数
void Timer0_Routine() interrupt 1
{
	static unsigned int T0Count;
	TH0 = 64535 / 256;	//溢出后重新设置定时初值
	TL0 = 64535 % 256;	//溢出后重新设置定时初值
	T0Count++;
	if (T0Count>=1000)
	{
//		T0Count=0;
//		P2_0=~P2_0;
//		function
	}
}